__author__ = 'Кузьмина Екатерина Алексеевна'

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

# код пишем тут...

number = int(input('Введите целое число от 0 до 15: '))
while number<=15:
    print(number)
    number = number + 1
print('программа завершена успешно')